const M700 = [
	'電力控制異常報警', // b0
	'加熱斷路器OFF', // b1
	'主電源相序錯誤', // b2
	'滑閥泵斷路器OFF', // b3
	'滑閥泵停止報警', // b4
	'滑閥泵過載報警', // b5
	'羅茨泵過載報警', // b6
	'冷卻風機異常報警', // b7
	'N2流量計異常報警', // b8
	'警急停止', // b9
	'分壓控制異常', // b10
	'空氣壓力低', // b11
	'脫脂壓力異常', // b12
	'檢漏異常', // b13
	'爐體前部水量報警', // b14
	'風機水量報警', // b15
	'爐體後部水量報警', // b16
	'後門前部水量報警', // b17
	'前門水量報警', // b18
	'捕蠟器水量報警', // b19
	'進水壓力低報警', // b20
	'出水壓力高報警', // b21
	'上部電极水量報警', // b22
	'下部電极水量報警', // b23
	'上部熱電偶', // b24
	'下部熱電偶', // b25
	'RP滑閥水量低', // b26
	'MB羅茨水量低', // b27
	'真空上抽水量低', // b28
	'冷凝器水量低', // b29
	'氮氣壓力低', // b30
	'氬氣壓力低' // b31
];

const M732 = [
	'管道保溫OFF', // b0
	'溫度偏差過大報警', // b1
	'風扇熱電偶異常', // b2
	'氮氣警告', // b3
	'氬氣警告', // b4
	'空氣壓力低', // b5
	'電器櫃溫度過高', // b6
	'脫脂工藝異常', // b7
	'爐內壓力超壓報警', // b8
	'初期排氣異常', // b9
	'冷卻充氣異常', // b10
	'加熱絲1熱電偶異常', // b11
	'加熱絲2熱電偶異常', // b12
	'加熱絲3熱電偶異常', // b13
	'加熱絲4熱電偶異常', // b14
	'加熱絲5熱電偶異常', // b15
	'加熱絲6熱電偶異常', // b16
	'加熱絲7熱電偶異常', // b17
	'加熱絲8熱電偶異常', // b18
	'加熱絲9熱電偶異常', // b19
	'加熱絲10熱電偶異常', // b20
	'加熱絲11熱電偶異常', // b21
	'AR流量計異常', // b22
	'上部功率控制器異常', // b23
	'下部功率控制器異常', // b24
	'上部加熱斷路器', // b25
	'下部加熱斷路器', // b26
	'軟啟動器異常', // b27
	'(保留)', // b28
	'(保留)', // b29
	'(保留)', // b30
	'(保留)' // b31
];

// module.exports = { r30028, r30030, r30032 };
export { M700, M732 };
